In [31]:
import pandas as pd 
from sdv.single_table import GaussianCopulaSynthesizer
from sdv.metadata import SingleTableMetadata
import pickle
from pathlib import  Path
from sqlalchemy import create_engine, text
import warnings

warnings.filterwarnings('ignore')

In [9]:
from dotenv import load_dotenv
load_dotenv(dotenv_path='../.env')

True

In [10]:
df = pd.read_csv(r"../data/data.csv")

In [28]:
df.head()

,Unnamed: 0.1,Unnamed: 0,new_price,desc,address,chambres,salles de bains,surface,ascenseur,floor,terrasse,parking,Type,City,Nighberd
0,0,0,1000000,98 m² crossing apartment in the heart of the B...,Appartement à vendre Casablanca - Belvédère,2,1,98,Yes,5,Yes,No,Appartement,Casablanca,Belvédère
1,1,1,1750000,Office for sale of 173 m² in Casablanca - Your...,Bureau à vendre Casablanca - Autre,1,2,173,Yes,7,Yes,No,Bureau,Casablanca,Autre
2,2,2,2600000,"Discover your future home in Mandarona, Casabl...",Appartement à vendre Casablanca - Californie,3,2,150,Yes,3,Yes,Yes,Appartement,Casablanca,Californie
3,3,3,2290000,For Sale - Bright apartment of 130 m² fully re...,Appartement à vendre Casablanca - Les Hôpitaux,2,1,130,Yes,3,No,No,Appartement,Casablanca,Les Hôpitaux
4,4,4,1460000,Welcome to this charming apartment located in ...,Appartement à vendre Meknès - Hamria,3,2,163,Yes,2,No,No,Appartement,Meknès,Hamria

In [29]:
df.drop(df.columns[:2],axis=1,inplace=True)

In [30]:
df.head()

,new_price,desc,address,chambres,salles de bains,surface,ascenseur,floor,terrasse,parking,Type,City,Nighberd
0,1000000,98 m² crossing apartment in the heart of the B...,Appartement à vendre Casablanca - Belvédère,2,1,98,Yes,5,Yes,No,Appartement,Casablanca,Belvédère
1,1750000,Office for sale of 173 m² in Casablanca - Your...,Bureau à vendre Casablanca - Autre,1,2,173,Yes,7,Yes,No,Bureau,Casablanca,Autre
2,2600000,"Discover your future home in Mandarona, Casabl...",Appartement à vendre Casablanca - Californie,3,2,150,Yes,3,Yes,Yes,Appartement,Casablanca,Californie
3,2290000,For Sale - Bright apartment of 130 m² fully re...,Appartement à vendre Casablanca - Les Hôpitaux,2,1,130,Yes,3,No,No,Appartement,Casablanca,Les Hôpitaux
4,1460000,Welcome to this charming apartment located in ...,Appartement à vendre Meknès - Hamria,3,2,163,Yes,2,No,No,Appartement,Meknès,Hamria

In [31]:
df.drop(['desc','address'],axis=1,inplace=True)

In [32]:
df.head()

,new_price,chambres,salles de bains,surface,ascenseur,floor,terrasse,parking,Type,City,Nighberd
0,1000000,2,1,98,Yes,5,Yes,No,Appartement,Casablanca,Belvédère
1,1750000,1,2,173,Yes,7,Yes,No,Bureau,Casablanca,Autre
2,2600000,3,2,150,Yes,3,Yes,Yes,Appartement,Casablanca,Californie
3,2290000,2,1,130,Yes,3,No,No,Appartement,Casablanca,Les Hôpitaux
4,1460000,3,2,163,Yes,2,No,No,Appartement,Meknès,Hamria

In [33]:
df.dtypes

new_price           int64
chambres            int64
salles de bains     int64
surface             int64
ascenseur          object
floor               int64
terrasse           object
parking            object
Type               object
City               object
Nighberd           object
dtype: object

In [34]:
df.rename(columns={"salles de bains":"Sales_bain"},inplace=True)

In [35]:
df.columns

Index(['new_price', 'chambres', 'Sales_bain', 'surface', 'ascenseur', 'floor',
       'terrasse', 'parking', 'Type', 'City', 'Nighberd'],
      dtype='object')

In [40]:
def synthetic_generator(nb_rows):
    """
    this function serves as a synthetic data generator to simulate real time data generation 
    * first define the metadata
    * train the synthesizer
    * generate synthetic data providing the number of rows
    """
    save_path = Path("../model/synth_model.pkl")
    # defining meta data
    metadata = SingleTableMetadata()
    metadata.detect_from_dataframe(df)

    #training the synthesizer
    synthesizer = GaussianCopulaSynthesizer(metadata)
    synthesizer.fit(df)
    
    synthesizer.save(save_path)

    #generate the synthetic data
    synthetic_data = synthesizer.sample(nb_rows)

    return synthetic_data ,synthesizer
synthetic_generator(5)

(   new_price  chambres  Sales_bain  surface ascenseur  floor terrasse parking  \
 0    3166319         4           2      137       Yes      1       No      No
 1    2667252         3           1       58       Yes      1       No      No
 2     931728         2           2       93       Yes      3       No      No
 3     841420         2           1      124       Yes      3       No     Yes
 4    1966861         2           1      156       Yes      3      Yes     Yes

           Type          City      Nighberd
 0  Appartement  Charlesshire       Riviera
 1       Studio    New Rickey       Riviera
 2  Appartement    South Kent       Al Qods
 3       Studio   East Joshua  Almoustakbal
 4  Appartement  Hawkinsburgh     Belvédère  ,
 <sdv.single_table.copulas.GaussianCopulaSynthesizer at 0x1adc82f9f30>)

In [2]:
def synthic_data(nb_rows) -> pd.DataFrame:
    path = Path("..\model\synth_model.pkl")
    with open(path,'rb') as f:
        model = pickle.load(f)
    data = model.sample(nb_rows)
    return data

In [4]:
batch_data = synthic_data(3)

In [ ]:
def connect(batch_data):
    if batch_data.empty():
        raise ValueError("no data to insert")
    connection_str = "postgresql://neondb_owner:npg_Kc8GxRW2reyA@ep-falling-tree-ado06jov-pooler.c-2.us-east-1.aws.neon.tech/neondb?sslmode=require&channel_binding=require"
    engine = create_engine(connection_str)
    batch_data.to_sql("listings", engine, if_exists="append", index=False)

3

In [4]:
synthic_data(5)

,new_price,chambres,Sales_bain,surface,ascenseur,floor,terrasse,parking,Type,City,Nighberd
0,3166319,4,2,137,Yes,1,No,No,Appartement,Charlesshire,Riviera
1,2667252,3,1,58,Yes,1,No,No,Studio,New Rickey,Riviera
2,931728,2,2,93,Yes,3,No,No,Appartement,South Kent,Al Qods
3,841420,2,1,124,Yes,3,No,Yes,Studio,East Joshua,Almoustakbal
4,1966861,2,1,156,Yes,3,Yes,Yes,Appartement,Hawkinsburgh,Belvédère

In [6]:
import sqlite3

In [14]:
conn = sqlite3.connect(r'..\src\housing_pipeline.db')
conn.close()

In [13]:
df = pd.read_sql('select * from listings',conn)
df

,new_price,chambres,Sales_bain,surface,ascenseur,floor,terrasse,parking,Type,City,Nighberd
0,3166319,4,2,137,Yes,1,No,No,Appartement,Charlesshire,Riviera
1,2667252,3,1,58,Yes,1,No,No,Studio,New Rickey,Riviera

In [ ]:
import mysql.connector 

conn = mysql.connector.connect(
    host='localhost',
    user='',
    password=2003
)

In [ ]:

def aggregate_data(engine):
    table = pd.read_sql("""select "City" ,count("Nighberd") as "number_offers" , avg("new_price") as "avg_price" from listings
                            group by "City"
                            order by avg("new_price") desc
                        """,engine)
    table.to_sql('housing_city',engine,if_exists='replace',index=False)

           City  number_offers  avg_price
0  Charlesshire              2  3166319.0
1    New Rickey              2  2667252.0
2    South Kent              1   931728.0

In [3]:
import random
size = random.randint(1,100)
size

25

In [ ]:
(5300 + 850 + 1300 + 550) - 8500

-500

In [32]:
connection_str = "postgresql://neondb_owner:npg_Kc8GxRW2reyA@ep-falling-tree-ado06jov-pooler.c-2.us-east-1.aws.neon.tech/neondb?sslmode=require&channel_binding=require"
engine = create_engine(connection_str)
table = pd.read_sql("select * from unified_data", engine)
table.head()

,new_price,chambres,Sales_bain,surface,ascenseur,floor,terrasse,parking,Type,City,Nighberd,agency_city
0,3166319,4,2,137,Yes,1,No,No,Appartement,Charlesshire,Riviera,casa
1,2667252,3,1,58,Yes,1,No,No,Studio,New Rickey,Riviera,casa
2,931728,2,2,93,Yes,3,No,No,Appartement,South Kent,Al Qods,casa
3,841420,2,1,124,Yes,3,No,Yes,Studio,East Joshua,Almoustakbal,casa
4,1966861,2,1,156,Yes,3,Yes,Yes,Appartement,Hawkinsburgh,Belvédère,casa

In [34]:
table.shape

(5388, 12)

In [8]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   new_price    40 non-null     int64
 1   chambres     40 non-null     int64
 2   Sales_bain   40 non-null     int64
 3   surface      40 non-null     int64
 4   ascenseur    40 non-null     object
 5   floor        40 non-null     int64
 6   terrasse     40 non-null     object
 7   parking      40 non-null     object
 8   Type         40 non-null     object
 9   City         40 non-null     object
 10  Nighberd     40 non-null     object
 11  agency_city  40 non-null     object
dtypes: int64(5), object(7)
memory usage: 3.9+ KB

In [30]:
import requests
from datetime import  datetime

def send_repport_error(error):

    message = f""" the pipeline was not successful \n\n : {str(error)} """
    url = "https://api.telegram.org/bot8580369794:AAGHDA2peLd01Nql8W3lAZq5DUAYlETO1MI/sendMessage"
    payload = {"chat_id":8012551573, "text": message, "parse_mode": "MarkdownV2"}
    requests.post(url,data=payload)

error = "the table does not exist"
send_repport_error(error)

In [18]:
def send_repport_success(data_size_1,data_size_t):
    message = f"""
    date : {datetime.today()}
    the data pipeline completed successfully :\n
    **the pipeline status:**\n
    -----------------------------------
    |data size in t-1 :| {data_size_1}|
    -----------------------------------
    |data size in t : {data_size_t}   |
    -----------------------------------
    """
    url = f"https://api.telegram.org/bot8580369794:AAGHDA2peLd01Nql8W3lAZq5DUAYlETO1MI/sendMessage"
    payload = {"chat_id":8012551573, "text": message, "parse_mode": "Markdown"}
    requests.post(url,data=payload)

send_repport_success(10,10)